/*
 * @Author: N0ts
 * @Date: 2021-09-25 18:10:52
 * @LastEditTime: 2021-12-30 17:11:13
 * @Description: 更新日志
 * 1：新增；2：修改；3：修复；4：移除；5：重构；
 * @FilePath: /IceCreamSearch/js/log.js
 * @Mail：mail@n0ts.cn
 */

export default [
    {
        time: "2021-12-30",
        log: [
            "1；新增点击 bing 壁纸介绍即可跳转壁纸详情",
            "1；「主题色设置」预增了多种默认颜色一键切换",
            "1；新增哔哩哔哩的搜索",
            "1；搜索引擎现已可以删除啦",
            "2；文案颜色修改为黑灰",
            "2；上下键切换选项代码优化",
            "2；壁纸切换代码重构，优化性能",
            "3；切换 bing 壁纸介绍显示错误问题",
            "3；网址导航联动滚动位置错误问题",
            "5；日志展示重构",
            "5；天气更换为和风天气"
        ]
    },
    {
        time: "2021-12-29",
        log: [
            "1；新增搜索设置菜单",
            "2；点击一言即可快速复制",
            "3；修复一言隐藏失败问题",
            "5；菜单分类重构",
            "5；搜索引擎删除按钮样式重写"
        ]
    },
    {
        time: "2021-12-1",
        log: ["1；新增毛玻璃开关", "2；CSS 动画优化", "5；分类样式重构"]
    },
    {
        time: "2021-9-26",
        log: ["1；新增一言类型选择功能", "3；时间显示错误问题修复", "5；部分代码重构"]
    },
    {
        time: "2021-8-4",
        log: ["1；新增设置按钮位置修改", "1；新增版本差异数据更新", "2；优化了部分逻辑问题"]
    },
    {
        time: "2021-8-3",
        log: [
            "1；新增主题颜色设置",
            "1；新增一言开关",
            "2；手机端菜单字体样式修改",
            "2；搜索框阴影修改",
            "2；动画优化",
            "5；所有提示样式修改"
        ]
    },
    {
        time: "2021-7-5",
        log: [
            "1；新增当前时间显示",
            "1；新增天气获取",
            "1；网址列表后端已完成",
            "2；消息提示框现在可以进行关闭",
            "5；API重构已上线"
        ]
    },
    {
        time: "2021-6-28",
        log: [
            "1；新增重置配置功能",
            "3；修复了一言API加载失败问题",
            "3；修复了搜索结果不消失的问题",
            "5；介绍重写",
            "5；菜单重写"
        ]
    },
    {
        time: "2021-6-24",
        log: ["1；搜索结果支持上下键切换啦！", "5；搜索引擎回调重写，性能优化MAX提升"]
    },
    {
        time: "2021-6-21",
        log: ["2；元素获取代码优化", "3；搜索特殊字符无效修复", "3；自定义壁纸不显示图片信息修复"]
    },
    {
        time: "2021-6-4",
        log: [
            "2；移除了毛玻璃，优化流畅体验",
            "2；部分代码更新",
            "2；自适应更新",
            "3；壁纸修复",
            "5；后端更换为Node.js"
        ]
    },
    {
        time: "2021-1-19",
        log: [
            "1；全端自适应完成",
            "1；菜单新增关闭按钮",
            "1；版权与图片信息文字位置更改",
            "1；版权与图片信息文字可开关",
            "2；数据结构代码优化"
        ]
    },
    {
        time: "2020-12-27",
        log: ["1；随机切换壁纸保存"]
    },
    {
        time: "2020-12-22",
        log: [
            "1；搜索功能已完善",
            "1；搜索框右侧新增图标",
            "1；搜索框聚焦效果增加",
            "1；背景外链链接存储",
            "1；搜索结果动画增加",
            "1；点击搜索功能",
            "3；背景切换修复",
            "3；背景接口失效会启用备用壁纸"
        ]
    }
];
