/*
 * @Author: N0ts
 * @Date: 2021-09-25 18:10:52
 * @LastEditTime: 2021-09-26 22:04:28
 * @Description: 更新日志
 * @FilePath: \IceCreamSearch\js\log.js
 * @Mail：mail@n0ts.cn
 */

export default [
    {
        time: "2021-9-26",
        log: ["新增一言类型选择功能", "时间显示错误问题修复", "部分代码重构"]
    },
    {
        time: "2021-8-4",
        log: ["新增设置按钮位置修改", "新增版本差异数据更新", "优化了部分逻辑问题"]
    },
    {
        time: "2021-8-3",
        log: [
            "新增主题颜色设置",
            "新增一言开关",
            "手机端菜单字体样式修改",
            "搜索框阴影修改",
            "所有提示样式修改",
            "动画优化"
        ]
    },
    {
        time: "2021-7-5",
        log: ["新增当前时间显示", "新增天气获取", "网址列表后端已完成", "API重构已上线", "消息提示框现在可以进行关闭"]
    },
    {
        time: "2021-6-28",
        log: ["新增重置配置功能", "修复了一言API加载失败问题", "修复了搜索结果不消失的问题", "介绍重写", "菜单重写"]
    },
    {
        time: "2021-6-24",
        log: ["搜索引擎回调重写，性能优化MAX提升", "搜索结果支持上下键切换啦！"]
    },
    {
        time: "2021-6-21",
        log: ["搜索特殊字符无效修复", "自定义壁纸不显示图片信息修复", "元素获取代码优化"]
    },
    {
        time: "2021-6-4",
        log: ["壁纸修复", "后端更换为Node.js", "移除了毛玻璃，优化流畅体验", "部分代码更新", "自适应更新"]
    },
    {
        time: "2021-1-19",
        log: [
            "自适应完成",
            "菜单新增关闭按钮",
            "版权与图片信息文字位置更改",
            "版权与图片信息文字可开关",
            "数据结构代码优化"
        ]
    },
    {
        time: "2020-12-27",
        log: ["随机切换壁纸保存"]
    },
    {
        time: "2020-12-22",
        log: [
            "搜索功能已完善",
            "搜索框右侧新增图标",
            "搜索框聚焦效果增加",
            "搜索结果动画增加",
            "背景切换修复",
            "背景接口失效会启用备用壁纸",
            "背景外链链接存储",
            "点击搜索功能"
        ]
    }
];
